app/controllers/live_lists_controller.rb

    def index
        @streams = Stream.order('id desc').page(params[:page]).per(20)
---
SELECT  `streams`.* FROM `streams` ORDER BY id desc LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM `streams`

    def update
        @stream.update(params.require("stream").permit(:live_name, :start_time, :end_time))
---
UPDATE `streams` SET `live_name` = '测试1', `start_time` = '2021-01-13 00:00:00', `end_time` = '2021-01-13 00:00:00', `updated_at` = '2021-01-13 13:26:57' WHERE `streams`.`id` = 5

    def show
        @stream_infos = @stream.stream_infos.order('id desc').page(params[:page]).per(30)
---
SELECT  `stream_infos`.* FROM `stream_infos` WHERE `stream_infos`.`stream_id` = 5 ORDER BY id desc LIMIT 30 OFFSET 0

    def set_stream
        @stream = Stream.find_by(id: params["id"])
---
SELECT  `streams`.* FROM `streams` WHERE `streams`.`id` = 5 LIMIT 1